RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_fmac.c
    /* Indicate that there is no valid configuration done */
    hfmac->FilterParam = 0UL;

    /* FMAC_X1BUFCFG: Configure the input buffer within the internal memory if required */
    if (sConfig->InputBufferSize != 0U)
    {
      MODIFY_REG(hfmac->Instance->X1BUFCFG,                                                                   \
                 (FMAC_X1BUFCFG_X1_BASE | FMAC_X1BUFCFG_X1_BUF_SIZE),                                         \
                 (((((uint32_t)(sConfig->InputBaseAddress)) << FMAC_X1BUFCFG_X1_BASE_Pos)     & FMAC_X1BUFCFG_X1_BASE) | \
                  ((((uint32_t)(sConfig->InputBufferSize))  << FMAC_X1BUFCFG_X1_BUF_SIZE_Pos) & FMAC_X1BUFCFG_X1_BUF_SIZE)));
    }

    /* FMAC_X1BUFCFG: Configure the input threshold if valid when compared to the configured X1 size */
    if (sConfig->InputThreshold != FMAC_THRESHOLD_NO_VALUE)
    {
      /* Check the parameter */
      assert_param(IS_FMAC_THRESHOLD_APPLICABLE(FMAC_GET_X1_SIZE(hfmac), sConfig->InputThreshold, sConfig->InputAccess));

      MODIFY_REG(hfmac->Instance->X1BUFCFG, \
                 FMAC_X1BUFCFG_FULL_WM,     \
                 ((sConfig->InputThreshold) & FMAC_X1BUFCFG_FULL_WM));
    }

    /* FMAC_X2BUFCFG: Configure the coefficient buffer within the internal memory */
    if (sConfig->CoeffBufferSize != 0U)
    {
      MODIFY_REG(hfmac->Instance->X2BUFCFG,                                                                   \
                 (FMAC_X2BUFCFG_X2_BASE | FMAC_X2BUFCFG_X2_BUF_SIZE),                                         \
                 (((((uint32_t)(sConfig->CoeffBaseAddress)) << FMAC_X2BUFCFG_X2_BASE_Pos)     & FMAC_X2BUFCFG_X2_BASE) | \
                  ((((uint32_t)(sConfig->CoeffBufferSize))  << FMAC_X2BUFCFG_X2_BUF_SIZE_Pos) & FMAC_X2BUFCFG_X2_BUF_SIZE)));
    }

    /* FMAC_YBUFCFG: Configure the output buffer within the internal memory if required */
    if (sConfig->OutputBufferSize != 0U)
    {
      MODIFY_REG(hfmac->Instance->YBUFCFG,                                                                    \
                 (FMAC_YBUFCFG_Y_BASE | FMAC_YBUFCFG_Y_BUF_SIZE),                                             \
                 (((((uint32_t)(sConfig->OutputBaseAddress)) << FMAC_YBUFCFG_Y_BASE_Pos)     & FMAC_YBUFCFG_Y_BASE) |    \
                  ((((uint32_t)(sConfig->OutputBufferSize))  << FMAC_YBUFCFG_Y_BUF_SIZE_Pos) & FMAC_YBUFCFG_Y_BUF_SIZE)));
    }

    /* FMAC_YBUFCFG: Configure the output threshold if valid when compared to the configured Y size */
    if (sConfig->OutputThreshold != FMAC_THRESHOLD_NO_VALUE)
    {
      /* Check the parameter */
      assert_param(IS_FMAC_THRESHOLD_APPLICABLE(FMAC_GET_Y_SIZE(hfmac), sConfig->OutputThreshold, sConfig->OutputAccess));

      MODIFY_REG(hfmac->Instance->YBUFCFG, \
                 FMAC_YBUFCFG_EMPTY_WM,    \
                 ((sConfig->OutputThreshold) & FMAC_YBUFCFG_EMPTY_WM));
    }

    /* CR: Configure the clip feature */
    tmpcr = sConfig->Clip & FMAC_CR_CLIPEN;

    /* CR: If IT or DMA will be used, enable error interrupts.
      * Being more a debugging feature, FMAC_CR_SATIEN isn't enabled by default. */
    if ((sConfig->InputAccess  == FMAC_BUFFER_ACCESS_DMA) || (sConfig->InputAccess  == FMAC_BUFFER_ACCESS_IT) ||
        (sConfig->OutputAccess == FMAC_BUFFER_ACCESS_DMA) || (sConfig->OutputAccess == FMAC_BUFFER_ACCESS_IT))
    {
      tmpcr |= FMAC_IT_UNFLIEN | FMAC_IT_OVFLIEN;
    }

    /* CR: write the value */
    WRITE_REG(hfmac->Instance->CR, tmpcr);

    /* Save the input/output accesses in order to configure RIEN, WIEN, DMAREN and DMAWEN during filter start */
    hfmac->InputAccess = sConfig->InputAccess;
    hfmac->OutputAccess = sConfig->OutputAccess;

    /* Check whether the configured X2 is big enough for the filter */
#if defined(USE_FULL_ASSERT)
    x2size = FMAC_GET_X2_SIZE(hfmac);
#endif /* USE_FULL_ASSERT */
    assert_param(((sConfig->Filter == FMAC_FUNC_CONVO_FIR) && (x2size >= sConfig->P)) || \
                 ((sConfig->Filter == FMAC_FUNC_IIR_DIRECT_FORM_1) && (x2size >= ((uint32_t)sConfig->P + (uint32_t)sConfig->Q))));

    /* Build the PARAM value that will be used when starting the filter */
    hfmac->FilterParam = (FMAC_PARAM_START | sConfig->Filter |                   \
                          ((((uint32_t)(sConfig->P)) << FMAC_PARAM_P_Pos) & FMAC_PARAM_P) | \
                          ((((uint32_t)(sConfig->Q)) << FMAC_PARAM_Q_Pos) & FMAC_PARAM_Q) | \
                          ((((uint32_t)(sConfig->R)) << FMAC_PARAM_R_Pos) & FMAC_PARAM_R));

    /* Initialize the coefficient buffer if required (pCoeffA for FIR only) */
    if ((sConfig->pCoeffB != NULL) && (sConfig->CoeffBSize != 0U))
    {
      /* FIR/IIR: The provided coefficients should match X2 size */
      assert_param(((uint32_t)sConfig->CoeffASize + (uint32_t)sConfig->CoeffBSize) <= x2size);
      /* FIR/IIR: The size of pCoeffB should match the parameter P */
      assert_param(sConfig->CoeffBSize >= sConfig->P);
      /* pCoeffA should be provided for IIR but not for FIR */
      /* IIR : if pCoeffB is provided, pCoeffA should also be there */
      /* IIR: The size of pCoeffA should match the parameter Q */
      assert_param(((sConfig->Filter == FMAC_FUNC_CONVO_FIR) &&
                    (sConfig->pCoeffA == NULL) && (sConfig->CoeffASize == 0U)) ||
                   ((sConfig->Filter == FMAC_FUNC_IIR_DIRECT_FORM_1) &&
                    (sConfig->pCoeffA != NULL) && (sConfig->CoeffASize != 0U) &&
                    (sConfig->CoeffASize >= sConfig->Q)));

      /* Write number of values to be loaded, the data load function and start the operation */
      WRITE_REG(hfmac->Instance->PARAM,                      \
                (((uint32_t)(sConfig->CoeffBSize) << FMAC_PARAM_P_Pos) | \
                 ((uint32_t)(sConfig->CoeffASize) << FMAC_PARAM_Q_Pos) | \
                 FMAC_FUNC_LOAD_X2 | FMAC_PARAM_START));

      if (PreloadAccess == PRELOAD_ACCESS_POLLING)
      {
        /* Load the buffer into the internal memory */
        FMAC_WritePreloadDataIncrementPtr(hfmac, &(sConfig->pCoeffB), sConfig->CoeffBSize);

