RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7xx_HAL/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_fmac.c
        /* Load pCoeffA if needed */
        if ((sConfig->pCoeffA != NULL) && (sConfig->CoeffASize != 0U))
        {
          /* Load the buffer into the internal memory */
          FMAC_WritePreloadDataIncrementPtr(hfmac, &(sConfig->pCoeffA), sConfig->CoeffASize);
        }

        /* Wait for the end of the writing */
        if (FMAC_WaitOnStartUntilTimeout(hfmac, tickstart, HAL_FMAC_TIMEOUT_VALUE) != HAL_OK)
        {
          hfmac->State = HAL_FMAC_STATE_TIMEOUT;
          return HAL_TIMEOUT;
        }

        /* Change the FMAC state */
        hfmac->State = HAL_FMAC_STATE_READY;
      }
      else
      {
        hfmac->pInput = sConfig->pCoeffA;
        hfmac->InputCurrentSize = sConfig->CoeffASize;

        /* Set the FMAC DMA transfer complete callback */
        hfmac->hdmaPreload->XferHalfCpltCallback = NULL;
        hfmac->hdmaPreload->XferCpltCallback = FMAC_DMAFilterConfig;
        /* Set the DMA error callback */
        hfmac->hdmaPreload->XferErrorCallback = FMAC_DMAError;

        /* Enable the DMA stream managing FMAC preload data write */
        return (HAL_DMA_Start_IT(hfmac->hdmaPreload, (uint32_t)sConfig->pCoeffB, (uint32_t)&hfmac->Instance->WDATA,
                                 sConfig->CoeffBSize));
      }
    }
    else
    {
      /* Change the FMAC state */
      hfmac->State = HAL_FMAC_STATE_READY;
    }
  }
  else
  {
    /* Return function status */
    return HAL_BUSY;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Preload the input (FIR, IIR) and output data (IIR) of the FMAC filter.
  *         They will be used by FMAC as soon as HAL_FMAC_FilterStart is called.
  * @param  hfmac pointer to a FMAC_HandleTypeDef structure that contains
  *         the configuration information for FMAC module.
  * @param  pInput Preloading of the first elements of the input buffer (X1).
  *         If not needed (no data available when starting), it should be set to NULL.
  * @param  InputSize Size of the input vector.
  *         As pInput is used for preloading data, it cannot be bigger than the input memory area.
  * @param  pOutput [IIR] Preloading of the first elements of the output vector (Y).
  *         If not needed, it should be set to NULL.
  * @param  OutputSize Size of the output vector.
  *         As pOutput is used for preloading data, it cannot be bigger than the output memory area.
  * @param  PreloadAccess buffer preload method
  *         This parameter can be one of the following values:
  *           @arg @ref PRELOAD_ACCESS_POLLING preloading using CPU
  *           @arg @ref PRELOAD_ACCESS_DMA Get preloading using DMA
  * @note   The input and the output buffers can be filled by calling several times HAL_FMAC_FilterPreload
  *         (each call filling partly the buffers). In case of overflow (too much data provided through
  *         all these calls), an error will be returned.
  * @retval HAL status
  */
static HAL_StatusTypeDef FMAC_FilterPreload(FMAC_HandleTypeDef *hfmac, int16_t *pInput, uint8_t InputSize,
                                            int16_t *pOutput, uint8_t OutputSize, uint8_t PreloadAccess)
{
  uint32_t tickstart;

  /* Check the START bit state */
  if (FMAC_GET_START_BIT(hfmac) != 0UL)
  {
    return HAL_ERROR;
  }

  /* Check that a valid configuration was done previously */
  if (hfmac->FilterParam == 0UL)
  {
    return HAL_ERROR;
  }

  /* Check the preload input buffers isn't too big */
  if ((InputSize > FMAC_GET_X1_SIZE(hfmac)) && (pInput != NULL))
  {
    return HAL_ERROR;
  }

  /* Check the preload output buffer isn't too big */
  if ((OutputSize > FMAC_GET_Y_SIZE(hfmac)) && (pOutput != NULL))
  {
    return HAL_ERROR;
  }

  /* Check handle state is ready */
  if (hfmac->State == HAL_FMAC_STATE_READY)
  {
    /* Change the FMAC state */
    hfmac->State = HAL_FMAC_STATE_BUSY;

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Preload the input buffer if required */
    if ((pInput != NULL) && (InputSize != 0U))
    {
      /* Write number of values to be loaded, the data load function and start the operation */
      WRITE_REG(hfmac->Instance->PARAM, \
                (((uint32_t)InputSize << FMAC_PARAM_P_Pos) | FMAC_FUNC_LOAD_X1 | FMAC_PARAM_START));

      if (PreloadAccess == PRELOAD_ACCESS_POLLING)
      {
        /* Load the buffer into the internal memory */
        FMAC_WritePreloadDataIncrementPtr(hfmac, &pInput, InputSize);

        /* Wait for the end of the writing */
        if (FMAC_WaitOnStartUntilTimeout(hfmac, tickstart, HAL_FMAC_TIMEOUT_VALUE) != HAL_OK)
        {
          hfmac->State = HAL_FMAC_STATE_TIMEOUT;
          return HAL_TIMEOUT;
        }
      }
      else
      {
        hfmac->pInput = pOutput;
        hfmac->InputCurrentSize = OutputSize;

        /* Set the FMAC DMA transfer complete callback */
        hfmac->hdmaPreload->XferHalfCpltCallback = NULL;
        hfmac->hdmaPreload->XferCpltCallback = FMAC_DMAFilterPreload;
        /* Set the DMA error callback */
        hfmac->hdmaPreload->XferErrorCallback = FMAC_DMAError;

        /* Enable the DMA stream managing FMAC preload data write */
        return (HAL_DMA_Start_IT(hfmac->hdmaPreload, (uint32_t)pInput, (uint32_t)&hfmac->Instance->WDATA, InputSize));
      }
    }

    /* Preload the output buffer if required */
    if ((pOutput != NULL) && (OutputSize != 0U))
    {
      /* Write number of values to be loaded, the data load function and start the operation */
      WRITE_REG(hfmac->Instance->PARAM, \
                (((uint32_t)OutputSize << FMAC_PARAM_P_Pos) | FMAC_FUNC_LOAD_Y | FMAC_PARAM_START));

      if (PreloadAccess == PRELOAD_ACCESS_POLLING)
      {
        /* Load the buffer into the internal memory */
        FMAC_WritePreloadDataIncrementPtr(hfmac, &pOutput, OutputSize);

        /* Wait for the end of the writing */
        if (FMAC_WaitOnStartUntilTimeout(hfmac, tickstart, HAL_FMAC_TIMEOUT_VALUE) != HAL_OK)
        {
          hfmac->State = HAL_FMAC_STATE_TIMEOUT;
          return HAL_TIMEOUT;
        }
      }
      else
      {
        hfmac->pInput = NULL;
        hfmac->InputCurrentSize = 0U;

        /* Set the FMAC DMA transfer complete callback */
        hfmac->hdmaPreload->XferHalfCpltCallback = NULL;
        hfmac->hdmaPreload->XferCpltCallback = FMAC_DMAFilterPreload;
        /* Set the DMA error callback */
        hfmac->hdmaPreload->XferErrorCallback = FMAC_DMAError;

        /* Enable the DMA stream managing FMAC preload data write */
        return (HAL_DMA_Start_IT(hfmac->hdmaPreload, (uint32_t)pOutput, (uint32_t)&hfmac->Instance->WDATA, OutputSize));
      }
    }

    /* Update the error codes */
    if (__HAL_FMAC_GET_FLAG(hfmac, FMAC_FLAG_OVFL))
    {
      hfmac->ErrorCode |= HAL_FMAC_ERROR_OVFL;
    }
    if (__HAL_FMAC_GET_FLAG(hfmac, FMAC_FLAG_UNFL))
    {
      hfmac->ErrorCode |= HAL_FMAC_ERROR_UNFL;
    }

    /* Change the FMAC state */
    hfmac->State = HAL_FMAC_STATE_READY;

    /* Return function status */
    if (hfmac->ErrorCode == HAL_FMAC_ERROR_NONE)
    {
      return HAL_OK;
    }
    else
    {
      return HAL_ERROR;
    }
  }
  else
  {
    /* Return function status */
    return HAL_BUSY;
  }
}

/**
  * @brief  Write data into FMAC internal memory through WDATA and increment input buffer pointer.
  *         This function is only used with preload functions.
  * @param  hfmac pointer to a FMAC_HandleTypeDef structure that contains
  *         the configuration information for FMAC module.
  * @param  ppData pointer to pointer to the data buffer.
  * @param  Size size of the data buffer.
  * @retval none
  */
static void FMAC_WritePreloadDataIncrementPtr(FMAC_HandleTypeDef *hfmac, int16_t **ppData, uint8_t Size)
{
  uint8_t index;

  /* Load the buffer into the internal memory */
  for (index = Size; index > 0U; index--)
  {
    WRITE_REG(hfmac->Instance->WDATA, (((uint32_t)(*(*ppData))) & FMAC_WDATA_WDATA));
    (*ppData)++;
  }
}

/**
  * @brief  Handle FMAC Function Timeout.
  * @param  hfmac FMAC handle.
  * @param  Tickstart Tick start value.
  * @param  Timeout Timeout duration.
  * @retval HAL status
  */
static HAL_StatusTypeDef FMAC_WaitOnStartUntilTimeout(FMAC_HandleTypeDef *hfmac, uint32_t Tickstart, uint32_t Timeout)
{
  /* Wait until flag changes */
  while (READ_BIT(hfmac->Instance->PARAM, FMAC_PARAM_START) != 0UL)
  {
    if ((HAL_GetTick() - Tickstart) > Timeout)
    {
      /* Process Unlocked */
      __HAL_UNLOCK(hfmac);

